app/views/employees/_form.html.erb

    <%= f.label :Skills %><br>
    <%= f.collection_check_boxes :skill_ids, Skill.all, :id, :skill do |m| %>
---
SELECT "skills".* FROM "skills" WHERE 1=0

   <%= f.label :Team_lead%><br>
   <%= f.collection_radio_buttons :lead_id, Lead.all, :id, :lead_name do |m| %>
---
SELECT "leads".* FROM "leads"

    <%= f.label :Project%> <br>
   <%= f.collection_select :project_id, Project.order(:project),:id,:project, include_blank: true %>
---
SELECT "projects".* FROM "projects" ORDER BY "projects"."project" ASC