app/views/employees/show.html.erb

SELECT "skills".* FROM "skills" INNER JOIN "employees_skills" ON "skills"."id" = "employees_skills"."skill_id" WHERE "employees_skills"."employee_id" = ?  [["employee_id", 4]]
---
  <strong>Skills:</strong>
  <% @employee.skills.each do |skill| %>