app/controllers/employees_controller.rb

  def update
    Rails.logger.debug "ffffffff #{params[:id].inspect}"
    @employee = Employee.find(params[:id])
    if @employee.update(employee_params)
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "employees" SET "name" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["name", "ABCDafsdfgfrg"], ["updated_at", "2017-06-19 11:47:46.502618"], ["id", 13]]

  def create

    @employee = Employee.new(employee_params)

    if @employee.save
---
INSERT INTO "employees" ("name", "age", "created_at", "updated_at", "designation", "lead_id", "project_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Test almost final"], ["age", 22], ["created_at", "2017-06-20 10:23:16.600098"], ["updated_at", "2017-06-20 10:23:16.600098"], ["designation", "FSD"], ["lead_id", 1], ["project_id", 1]]