app/controllers/leads_controller.rb

  def index
    @leads = Lead.all
---
SELECT "leads".* FROM "leads"

  def show
    @lead = Lead.find(params[:id])
    @emp_list = @lead.employees
    @emp_list_sorted = @emp_list.sort {|a,b| b.skills.count <=> a.skills.count}
---
SELECT  "leads".* FROM "leads" WHERE "leads"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT COUNT(*) FROM "skills" INNER JOIN "employees_skills" ON "skills"."id" = "employees_skills"."skill_id" WHERE "employees_skills"."employee_id" = ?  [["employee_id", 4]]

  def create
    @lead = Lead.new(lead_params)

    @lead.save
---
INSERT INTO "leads" ("lead_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["lead_name", "Achaov"], ["created_at", "2017-06-20 10:38:20.907408"], ["updated_at", "2017-06-20 10:38:20.907408"]]